; domain
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (domain sailing)
     (:requirements :typing :fluents)
     (:types
          boat person - object
     )
     (:predicates
          (saved ?t - person)
     )
     (:functions
          (x ?b - boat)
          (y ?b - boat)
          (d ?t - person)
     )
     ;; Increment the value in the given counter by one
     (:action go_north_east
          :parameters (?b - boat)
          :precondition (and)
          :effect (and(increase (x ?b) 1.5) (increase (y ?b) 1.5))
     )
     (:action go_north_west
          :parameters (?b - boat)
          :precondition (and)
          :effect (and(decrease (x ?b) 1.5) (increase (y ?b) 1.5))
     )
     (:action go_est
          :parameters (?b - boat)
          :precondition (and)
          :effect (and(increase (x ?b) 3))
     )
     (:action go_west
          :parameters (?b - boat)
          :precondition (and)
          :effect (and(decrease (x ?b) 3))
     )
     (:action go_south_west
          :parameters(?b - boat)
          :precondition (and)
          :effect (and(increase (x ?b) 2) (decrease (y ?b) 2))
     )
     (:action go_south_east
          :parameters(?b - boat)
          :precondition (and)
          :effect (and(decrease (x ?b) 2) (decrease (y ?b) 2))
     )
     (:action go_south
          :parameters(?b - boat)
          :precondition (and)
          :effect (and (decrease (y ?b) 2))
     )
     (:action save_person
          :parameters(?b - boat ?t - person)
          :precondition ( and (>= (+ (x ?b) (y ?b)) (d ?t))
               (>= (- (y ?b) (x ?b)) (d ?t))
               (<= (+ (x ?b) (y ?b)) (+ (d ?t) 25))
               (<= (- (y ?b) (x ?b)) (+ (d ?t) 25))
          )
          :effect (and(saved ?t))
     )

)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_11_10)

	(:domain sailing)

	(:objects
		b0 b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 - boat
		p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 - person
	)

  (:init
		(= (x b0) 9)
(= (y b0) 0)
(= (x b1) -6)
(= (y b1) 0)
(= (x b2) -2)
(= (y b2) 0)
(= (x b3) 8)
(= (y b3) 0)
(= (x b4) 1)
(= (y b4) 0)
(= (x b5) -8)
(= (y b5) 0)
(= (x b6) -1)
(= (y b6) 0)
(= (x b7) 10)
(= (y b7) 0)
(= (x b8) -10)
(= (y b8) 0)
(= (x b9) -5)
(= (y b9) 0)
(= (x b10) 2)
(= (y b10) 0)

		(= (d p0) 4)
(= (d p1) 71)
(= (d p2) 69)
(= (d p3) 10)
(= (d p4) 18)
(= (d p5) 6)
(= (d p6) 43)
(= (d p7) 39)
(= (d p8) 68)
(= (d p9) 12)

	)

	(:goal
		(and
			(saved p0)
(saved p1)
(saved p2)
(saved p3)
(saved p4)
(saved p5)
(saved p6)
(saved p7)
(saved p8)
(saved p9)
		)
	)
)

; plan
1. (go_north_east b6)
   changed: (x b6) from -1 to 0.5, (y b6) from 0 to 1.5
   goals met: 0 of 10
2. (go_north_east b6)
   changed: (x b6) from 0.5 to 2, (y b6) from 1.5 to 3
   goals met: 0 of 10
3. (go_north_east b6)
   changed: (x b6) from 2 to 3.5, (y b6) from 3 to 4.5
   goals met: 0 of 10
4. (go_north_east b6)
   changed: (x b6) from 3.5 to 5, (y b6) from 4.5 to 6
   goals met: 0 of 10
5. (go_north_east b6)
   changed: (x b6) from 5 to 6.5, (y b6) from 6 to 7.5
   goals met: 0 of 10
6. (go_north_east b6)
   changed: (x b6) from 6.5 to 8, (y b6) from 7.5 to 9
   goals met: 0 of 10
7. (go_north_east b6)
   changed: (x b6) from 8 to 9.5, (y b6) from 9 to 10.5
   goals met: 0 of 10
8. (go_north_west b6)
   changed: (x b6) from 9.5 to 8, (y b6) from 10.5 to 12
   goals met: 0 of 10
9. (save_person b6 p0)
   added: (saved p0)
   goals met: 1 of 10
10. (go_north_west b6)
   changed: (x b6) from 8 to 6.5, (y b6) from 12 to 13.5
   goals met: 1 of 10
11. (save_person b6 p5)
   added: (saved p5)
   goals met: 2 of 10
12. (go_north_west b6)
   changed: (x b6) from 6.5 to 5, (y b6) from 13.5 to 15
   goals met: 2 of 10
13. (save_person b6 p3)
   added: (saved p3)
   goals met: 3 of 10
14. (go_north_west b6)
   changed: (x b6) from 5 to 3.5, (y b6) from 15 to 16.5
   goals met: 3 of 10
15. (save_person b6 p9)
   added: (saved p9)
   goals met: 4 of 10
16. (go_north_west b6)
   changed: (x b6) from 3.5 to 2, (y b6) from 16.5 to 18
   goals met: 4 of 10
17. (go_north_west b6)
   changed: (x b6) from 2 to 0.5, (y b6) from 18 to 19.5
   goals met: 4 of 10
18. (save_person b6 p4)
   added: (saved p4)
   goals met: 5 of 10
19. (go_north_west b6)
   changed: (x b6) from 0.5 to -1, (y b6) from 19.5 to 21
   goals met: 5 of 10
20. (go_north_west b6)
   changed: (x b6) from -1 to -2.5, (y b6) from 21 to 22.5
   goals met: 5 of 10
21. (go_north_west b6)
   changed: (x b6) from -2.5 to -4, (y b6) from 22.5 to 24
   goals met: 5 of 10
22. (go_north_west b6)
   changed: (x b6) from -4 to -5.5, (y b6) from 24 to 25.5
   goals met: 5 of 10
23. (go_north_west b6)
   changed: (x b6) from -5.5 to -7, (y b6) from 25.5 to 27
   goals met: 5 of 10
24. (go_north_west b6)
   changed: (x b6) from -7 to -8.5, (y b6) from 27 to 28.5
   goals met: 5 of 10
25. (go_north_west b6)
   changed: (x b6) from -8.5 to -10, (y b6) from 28.5 to 30
   goals met: 5 of 10
26. (go_north_west b6)
   changed: (x b6) from -10 to -11.5, (y b6) from 30 to 31.5
   goals met: 5 of 10
27. (go_north_east b6)
   changed: (x b6) from -11.5 to -10, (y b6) from 31.5 to 33
   goals met: 5 of 10
28. (go_north_east b6)
   changed: (x b6) from -10 to -8.5, (y b6) from 33 to 34.5
   goals met: 5 of 10
29. (go_north_east b6)
   changed: (x b6) from -8.5 to -7, (y b6) from 34.5 to 36
   goals met: 5 of 10
30. (go_north_east b6)
   changed: (x b6) from -7 to -5.5, (y b6) from 36 to 37.5
   goals met: 5 of 10
31. (go_north_east b6)
   changed: (x b6) from -5.5 to -4, (y b6) from 37.5 to 39
   goals met: 5 of 10
32. (go_north_east b6)
   changed: (x b6) from -4 to -2.5, (y b6) from 39 to 40.5
   goals met: 5 of 10
33. (go_north_east b6)
   changed: (x b6) from -2.5 to -1, (y b6) from 40.5 to 42
   goals met: 5 of 10
34. (save_person b6 p7)
   added: (saved p7)
   goals met: 6 of 10
35. (go_north_east b6)
   changed: (x b6) from -1 to 0.5, (y b6) from 42 to 43.5
   goals met: 6 of 10
36. (save_person b6 p6)
   added: (saved p6)
   goals met: 7 of 10
37. (go_north_east b6)
   changed: (x b6) from 0.5 to 2, (y b6) from 43.5 to 45
   goals met: 7 of 10
38. (go_north_east b6)
   changed: (x b6) from 2 to 3.5, (y b6) from 45 to 46.5
   goals met: 7 of 10
39. (go_north_east b6)
   changed: (x b6) from 3.5 to 5, (y b6) from 46.5 to 48
   goals met: 7 of 10
40. (go_north_east b6)
   changed: (x b6) from 5 to 6.5, (y b6) from 48 to 49.5
   goals met: 7 of 10
41. (go_north_east b6)
   changed: (x b6) from 6.5 to 8, (y b6) from 49.5 to 51
   goals met: 7 of 10
42. (go_north_east b6)
   changed: (x b6) from 8 to 9.5, (y b6) from 51 to 52.5
   goals met: 7 of 10
43. (go_north_east b6)
   changed: (x b6) from 9.5 to 11, (y b6) from 52.5 to 54
   goals met: 7 of 10
44. (go_north_east b6)
   changed: (x b6) from 11 to 12.5, (y b6) from 54 to 55.5
   goals met: 7 of 10
45. (go_north_west b6)
   changed: (x b6) from 12.5 to 11, (y b6) from 55.5 to 57
   goals met: 7 of 10
46. (go_north_west b6)
   changed: (x b6) from 11 to 9.5, (y b6) from 57 to 58.5
   goals met: 7 of 10
47. (go_north_west b6)
   changed: (x b6) from 9.5 to 8, (y b6) from 58.5 to 60
   goals met: 7 of 10
48. (go_north_west b6)
   changed: (x b6) from 8 to 6.5, (y b6) from 60 to 61.5
   goals met: 7 of 10
49. (go_north_west b6)
   changed: (x b6) from 6.5 to 5, (y b6) from 61.5 to 63
   goals met: 7 of 10
50. (go_north_west b6)
   changed: (x b6) from 5 to 3.5, (y b6) from 63 to 64.5
   goals met: 7 of 10
51. (go_north_west b6)
   changed: (x b6) from 3.5 to 2, (y b6) from 64.5 to 66
   goals met: 7 of 10
52. (go_north_west b6)
   changed: (x b6) from 2 to 0.5, (y b6) from 66 to 67.5
   goals met: 7 of 10
53. (go_north_west b6)
   changed: (x b6) from 0.5 to -1, (y b6) from 67.5 to 69
   goals met: 7 of 10
54. (save_person b6 p8)
   added: (saved p8)
   goals met: 8 of 10
55. (go_north_east b6)
   changed: (x b6) from -1 to 0.5, (y b6) from 69 to 70.5
   goals met: 8 of 10
56. (save_person b6 p2)
   added: (saved p2)
   goals met: 9 of 10
57. (go_north_west b6)
   changed: (x b6) from 0.5 to -1, (y b6) from 70.5 to 72
   goals met: 9 of 10
58. (save_person b6 p1)
   added: (saved p1)
   goals met: 10 of 10
